app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-03-19 15:24:25.149338"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(first_name: params[:student][:first_name],
    last_name: params[:student][:last_name])